pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/SingleSpoutvanBuijtenen/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseEulerTurbFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.000025;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1.e-04;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        writeControl   writeTime;
        fields
        (
            U.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      5.0;
            }

            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      5.0;
            }

            alpha.particles
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
		 window      5.0;
            }
            p
            {
                 mean        on;
                 prime2Mean  on;
                 base        time;
		 window      5.0;
            }

        );
    }

}


// ************************************************************************* //
