pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/SingleSpoutvanBuijtenen/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices 
(
    (-0.0725 -0.01 0.00)
    (-0.0025 -0.01 0.00)
    (-0.0025  0.01 0.00)
    (-0.0725  0.01 0.00)
    (-0.0725 -0.01 0.50)
    (-0.0025 -0.01 0.50)
    (-0.0025  0.01 0.50)
    (-0.0725  0.01 0.50)
    ( 0.0025 -0.01 0.00)
    ( 0.0025  0.01 0.00)
    ( 0.0025 -0.01 0.50)
    ( 0.0025  0.01 0.50)
    ( 0.0725 -0.01 0.00)
    ( 0.0725  0.01 0.00)
    ( 0.0725 -0.01 0.50)
    ( 0.0725  0.01 0.50)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)       (17 4 100) simpleGrading (0.666666 1 2)
    hex (1 8 9 2 5 10 11 6)     (2  4 100) simpleGrading (1 1 2)
    hex (8 12 13 9 10 14 15 11) (17 4 100) simpleGrading (1.5 1 2)
);

edges
(
);

boundary
(
    inlet
    {
	    type patch;
        faces
        (
            (1 2 9 8)
        );
    }
    inlet_bg
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (8 9 13 12)
        );
    }
    outlet
    {
        type patch; 
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (10 14 15 11)
        );  
    }
    wall2
    {
        type wall;
        faces
        (
    	    (0 3 7 4)
    	    (12 13 15 14)
        );
    }
    wall
    {
        type wall;
        faces
        (
    	    (0 4 5 1)
            (1 5 10 8)
            (8 10 14 12)
            (3 2 6 7)
            (2 9 11 6)
            (9 13 15 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
