pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/SingleSpoutvanBuijtenen/0.orig/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    inlet_bg
    {
        type            zeroGradient;
    }


    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
